177. Nth Highest Salary

Table: Employee

+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| salary      | int  |
+-------------+------+
id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.
 

Write a solution to find the nth highest salary from the Employee table. If there is no nth highest salary, return null.

The result format is in the following example.

 

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
n = 2
Output: 
+------------------------+
| getNthHighestSalary(2) |
+------------------------+
| 200                    |
+------------------------+
Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
n = 2
Output: 
+------------------------+
| getNthHighestSalary(2) |
+------------------------+
| null                   |
+------------------------+

In [55]:
import pandas as pd

In [51]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    employee=employee.drop_duplicates("salary")
    if employee.shape[0]>=N:
        print(employee.shape[0])
        employee= employee.sort_values("salary", ascending=False)
        print(employee)
        output_value = {"val": employee.iloc[N-1][1]}
        print(output_value )
    else:
        output_value = {"val": None}
        print(output_value )
    column = "getNthHighestSalary("+str(N)+")"
    output_df = pd.DataFrame([output_value["val"]], columns=[column])   
    return output_df

Example 1

In [ ]:
employees = {"id":[1,2,3],
            "salary":[100,200,300]}

employees_df = pd.DataFrame(employees)

display(employees_df)

In [52]:
N = 2

nth_highest_salary(employees_df,N)

3
   id  salary
2   3     300
1   2     200
0   1     100
{'val': 200}

   getNthHighestSalary(2)
0                     200

Example 2

In [47]:
employees = {"id":[1,2],
            "salary":[100,100]}

employees_df = pd.DataFrame(employees)

display(employees_df)

   id  salary
0   1     100
1   2     100

In [48]:
N = 2

nth_highest_salary(employees_df,N)

{'val': None}

  getNthHighestSalary(2)
0                   None

Example 3

In [53]:
employees = {"id":[1,2,3],
            "salary":[100,200,300]}

employees_df = pd.DataFrame(employees)

display(employees_df)

   id  salary
0   1     100
1   2     200
2   3     300

In [54]:
N = 1

nth_highest_salary(employees_df,N)

3
   id  salary
2   3     300
1   2     200
0   1     100
{'val': 300}

   getNthHighestSalary(1)
0                     300